import streamlit as st
import numpy as np
import pandas as p
from PIL import Image

st.title('Streamlit 超入門')

st.write('Interactive Widgets')

#######################################################################
#checkboxにチェックが入っていたら中身を表示
#######################################################################
if st.checkbox('Show Image'):
    img = Image.open('柴犬唐草模様.jpg')
    st.image(img, caption='Test Image', use_column_width=True)

#######################################################################
#selectboxで選んだ値を表示
#######################################################################
option = st.selectbox(
    'あなたが好きな数字を教えてください。',
    list(range(1,11))
)

'あなたの好きな数字は、', option, 'です。'

#######################################################################
#textに入力した内容を表示
#######################################################################
text = st.text_input('あなたの趣味を教えてください。')
'あなたの趣味 :', text

#######################################################################
#sliderに入力した内容を表示
#######################################################################
condition = st.slider('あなたの今の調子は？', 0, 100, 50)                  #(0, 100, 50)＝(最小値, 最大値, 初期値)
'コンディション ：', condition